tap "derailed/k9s"
tap "dotenvx/brew"
tap "homebrew/bundle"
tap "homebrew/services"
tap "kdash-rs/kdash"
tap "lusingander/tap"
tap "olets/tap"
tap "oven-sh/bun"
tap "ynqa/tap"
##################################
# neovim
brew "neovim"
# All-in-one AI-Powered CLI Chat & Copilot
brew "aichat"
# Library for command-line editing
brew "readline"
# AI pair programming in your terminal
brew "aider"
# Code searching, linting, rewriting
brew "ast-grep"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# Official Amazon AWS command-line interface
brew "awscli"
# Fully functional local AWS cloud stack
brew "localstack"
# Thin wrapper around the `aws` command-line interface for use with LocalStack
brew "awscli-local"
# Terminal bandwidth utilization tool
brew "bandwhich"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Toolchain of the web
brew "biome"
# New way to see and navigate directory trees
brew "broot"
# Versatile and fast Unicode/ASCII/ANSI graphics renderer
brew "chafa"
# Create and view interactive cheat sheets for *nix commands
brew "cheat"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Top-like interface for container metrics
brew "ctop"
# Open source multi-tool for exploring and publishing data
brew "datasette"
# DuckDuckGo from the terminal
brew "ddgr"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Diff that understands syntax
brew "difftastic"
# Load/unload environment variables based on $PWD
brew "direnv"
# View disk space usage and delete unwanted data, fast
brew "dua-cli"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# More intuitive version of du in rust
brew "dust"
# Run arbitrary commands when files change
brew "entr"
# AST-based pattern checker for JavaScript
brew "eslint"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Fast and simple Node.js version manager
brew "fnm"
# Terminal JSON viewer
brew "fx"
# Command-line fuzzy finder written in Go
brew "fzf"
# Graphics library to dynamically manipulate images
brew "gd"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Alternative to top/htop
brew "glances"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Ping, but with a graph
brew "gping"
# Command-line tool for generating regular expressions
brew "grex"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Interactive JSON filter using jq
brew "jnv"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Handy way to save and run project-specific commands
brew "just"
# CLI calendar application
brew "khal"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Simple terminal UI for git commands
brew "lazygit"
# Input filter for the pager less
brew "lesspipe"
# Package manager for the Lua programming language
brew "luarocks"
# Keep your Mac's application settings in sync
brew "mackup"
# Mac App Store command-line interface
brew "mas"
# Powerful paging program
brew "most"
# Interactive cheatsheet tool for the command-line
brew "navi"
# Manage multiple Node.js versions
brew "nvm"
# CLI for Postgres with auto-completion and syntax highlighting
brew "pgcli"
# Manage compile and link flags for libraries
brew "pkg-config"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Modern replacement for ps written by Rust
brew "procs"
# Cloud native development platform
brew "pulumi"
# Python version management
brew "pyenv"
# Cross-platform application and UI framework
brew "qt@5"
# Generate types and converters from JSON, Schema, and GraphQL
brew "quicktype"
# Convert character set (charsets)
brew "recode"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Wrapper around ripgrep that adds multiple rich file types
brew "ripgrep-all"
# Command-line deletion tool focused on safety, ergonomics, and performance
brew "rm-improved"
# Experimental Package Management Solution for Python
brew "rye"
# Fast and accurate code counter with complexity and COCOMO estimates
brew "scc"
# Intuitive find & replace CLI
brew "sd"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Graphical command-line client for SSH
brew "sshs"
# Cross-shell prompt for astronauts
brew "starship"
# Log file highlighter
brew "tailspin"
# Programmatically correct mistyped console commands
brew "thefuck"
# Text interface for Git repositories
brew "tig"
# Simplified and community-driven man pages
brew "tldr"
# Instant terminal sharing
brew "tmate"
# Terminal multiplexer
brew "tmux"
# Tmux session manager. Built on libtmux
brew "tmuxp"
# Modern reverse proxy
brew "traefik"
# Lightweight, POSIX-compliant regular expression (regex) library
brew "tre"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Network diagnostic tool, inspired by mtr
brew "trippy"
# Internet file retriever
brew "wget"
# Friendly and fast tool for sending HTTP requests
brew "xh"
# Command-line program for getting and setting the contents of the X selection
brew "xsel"
# Fast CSV toolkit written in Rust
brew "xsv"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Additional completion definitions for zsh
brew "zsh-completions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# ZSH plugin that reminds you to use existing aliases for commands you just typed
brew "zsh-you-should-use"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "derailed/k9s/k9s"
# Better dotenv–from the creator of `dotenv`
brew "dotenvx/brew/dotenvx"
# A fast and simple dashboard for Kubernetes written in Rust
brew "kdash-rs/kdash/kdash"
# TUI application for AWS S3 written in Rust using ratatui
brew "lusingander/tap/stu"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# Interactive grep (for streaming)
brew "ynqa/tap/sigrs"

##################################
# Chromium based browser
cask "arc"
# duck duck go privacy
cask "duckduckgo"
# Contacts manager
cask "cardhop"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Write, edit, and chat about your code with AI
cask "cursor"
# API documentation browser and code snippet manager
cask "dash"
# Utilities designed to make common development tasks easier
cask "devtoys"
# All-in-one toolbox for developers
cask "devutils"
# Web browser focusing on privacy
cask "duckduckgo"
# Calendar software
cask "fantastical"
# Web browser
cask "google-chrome"
# Desktop automation application
cask "hammerspoon"
# Open source API development ecosystem
cask "hoppscotch"
# System monitoring app
cask "istat-menus"
# Terminal emulator Warp
cask "warp"
# Discover, download, and run local LLMs
cask "lm-studio"
# Adaptive brightness for external displays
cask "lunar"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Get up and running with large language models locally
cask "ollama"
# Verify system files structure, run miscellaneous maintenance and more
cask "onyx"
# Replacement for Docker Desktop
cask "orbstack"
# PDF reader, editor and annotator
cask "pdf-expert"
# Browse, manage, inspect containers and images
cask "podman-desktop"
# HTTP debugging proxy
cask "proxyman"
# Companion app for Flipper Zero devices
cask "qflipper"
# Control your tools with a few keystrokes
cask "raycast"
# Instant messaging application focusing on security
cask "signal"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Daily planner and calendar
cask "sunsama"
# Email client
cask "superhuman"
# Mesh VPN based on WireGuard
cask "tailscale"
# To-do list
cask "todoist"
# Open-source code editor
cask "visual-studio-code"
# Video communication and virtual meeting platform
cask "zoom"
##################################
mas "Bear", id: 1091189122
mas "Bitwarden", id: 1352778147
mas "KakaoTalk", id: 869223134
mas "LanScan", id: 472226235
mas "Omnivore", id: 1564031042
