tap "derailed/k9s"
tap "dotenvx/brew"
tap "homebrew/bundle"
tap "homebrew/services"
tap "kdash-rs/kdash"
tap "lusingander/tap"
tap "minio/stable"
tap "olets/tap"
tap "oven-sh/bun"
tap "supabase/tap"
tap "ynqa/tap"
# neovim
brew "neovim"
# All-in-one AI-Powered CLI Chat & Copilot
brew "aichat"
# Library for command-line editing
brew "readline"
# AI pair programming in your terminal
brew "aider"
# Record and share terminal sessions
brew "asciinema"
# Code searching, linting, rewriting
brew "ast-grep"
# Source code beautifier for C, C++, C#, and Java
brew "astyle"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# Official Amazon AWS command-line interface
brew "awscli"
# Fully functional local AWS cloud stack
brew "localstack"
# Thin wrapper around the `aws` command-line interface for use with LocalStack
brew "awscli-local"
# Terminal bandwidth utilization tool
brew "bandwhich"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Toolchain of the web
brew "biome"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# Linux/OSX/FreeBSD resource monitor
brew "bpytop"
# New way to see and navigate directory trees
brew "broot"
# Versatile and fast Unicode/ASCII/ANSI graphics renderer
brew "chafa"
# Create and view interactive cheat sheets for *nix commands
brew "cheat"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Music player with an ncurses based interface
brew "cmus"
# Top-like interface for container metrics
brew "ctop"
# Open source multi-tool for exploring and publishing data
brew "datasette"
# DuckDuckGo from the terminal
brew "ddgr"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Diff that understands syntax
brew "difftastic"
# Load/unload environment variables based on $PWD
brew "direnv"
# View disk space usage and delete unwanted data, fast
brew "dua-cli"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# More intuitive version of du in rust
brew "dust"
# Run arbitrary commands when files change
brew "entr"
# AST-based pattern checker for JavaScript
brew "eslint"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Fast and simple Node.js version manager
brew "fnm"
# Terminal JSON viewer
brew "fx"
# Command-line fuzzy finder written in Go
brew "fzf"
# Fast, simple fuzzy text selector with an advanced scoring algorithm
brew "fzy"
# Graphics library to dynamically manipulate images
brew "gd"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Alternative to top/htop
brew "glances"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Ping, but with a graph
brew "gping"
# Command-line tool for generating regular expressions
brew "grex"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Run and Test HTTP Requests with plain text and curl
brew "hurl"
# Command-line benchmarking tool
brew "hyperfine"
# Interactive JSON filter using jq
brew "jnv"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Handy way to save and run project-specific commands
brew "just"
# CLI calendar application
brew "khal"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Simple terminal UI for git commands
brew "lazygit"
# Input filter for the pager less
brew "lesspipe"
# Package manager for the Lua programming language
brew "luarocks"
# Keep your Mac's application settings in sync
brew "mackup"
# Mac App Store command-line interface
brew "mas"
# Powerful paging program
brew "most"
# Interactive cheatsheet tool for the command-line
brew "navi"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Manage multiple Node.js versions
brew "nvm"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# CLI for Postgres with auto-completion and syntax highlighting
brew "pgcli"
# Manage compile and link flags for libraries
brew "pkg-config"
# Tool for managing OCI containers and pods
brew "podman"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Wrapper to colorize and simplify ping's output
brew "prettyping"
# Modern replacement for ps written by Rust
brew "procs"
# Cloud native development platform
brew "pulumi"
# Python version management
brew "pyenv"
# Cross-platform application and UI framework
brew "qt@5"
# Generate types and converters from JSON, Schema, and GraphQL
brew "quicktype"
# Convert character set (charsets)
brew "recode"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Wrapper around ripgrep that adds multiple rich file types
brew "ripgrep-all"
# Command-line deletion tool focused on safety, ergonomics, and performance
brew "rm-improved"
# Experimental Package Management Solution for Python
brew "rye"
# Fast and accurate code counter with complexity and COCOMO estimates
brew "scc"
# Intuitive find & replace CLI
brew "sd"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Graphical command-line client for SSH
brew "sshs"
# Cross-shell prompt for astronauts
brew "starship"
# Log file highlighter
brew "tailspin"
# Programmatically correct mistyped console commands
brew "thefuck"
# Text interface for Git repositories
brew "tig"
# Simplified and community-driven man pages
brew "tldr"
# Instant terminal sharing
brew "tmate"
# Terminal multiplexer
brew "tmux"
# Tmux session manager. Built on libtmux
brew "tmuxp"
# Modern reverse proxy
brew "traefik"
# Lightweight, POSIX-compliant regular expression (regex) library
brew "tre"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Network diagnostic tool, inspired by mtr
brew "trippy"
# Internet file retriever
brew "wget"
# Friendly and fast tool for sending HTTP requests
brew "xh"
# Command-line program for getting and setting the contents of the X selection
brew "xsel"
# Fast CSV toolkit written in Rust
brew "xsv"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Additional completion definitions for zsh
brew "zsh-completions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# ZSH plugin that reminds you to use existing aliases for commands you just typed
brew "zsh-you-should-use"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "derailed/k9s/k9s"
# Better dotenv–from the creator of `dotenv`
brew "dotenvx/brew/dotenvx"
# A fast and simple dashboard for Kubernetes written in Rust
brew "kdash-rs/kdash/kdash"
# TUI application for AWS S3 written in Rust using ratatui
brew "lusingander/tap/stu"
# High Performance Object Storage compatible with Amazon S3 API
brew "minio/stable/minio"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# Supabase CLI
brew "supabase/tap/supabase"
# Interactive grep (for streaming)
brew "ynqa/tap/sigrs"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Private desktop AI chat application
cask "anythingllm"
# Chromium based browser
cask "arc"
# duck duck go privacy
cask "duckduckgo"
# Data backup and storage service
cask "backblaze"
# Alternative GUI for Time Machine
cask "backuploupe"
# Menu bar icon organiser
cask "bartender"
# Menu item for starting and stopping homebrew services
cask "brewservicesmenubar"
# Test localhost and staging websites
cask "browserstacklocal"
# Hard disk backup and cloning utility
cask "carbon-copy-cloner"
# Contacts manager
cask "cardhop"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Tool to list all active shortcuts of the current application
cask "cheatsheet"
# Two-panel file manager
cask "commander-one"
# Track and budget money
cask "copilot"
# Write, edit, and chat about your code with AI
cask "cursor"
# API documentation browser and code snippet manager
cask "dash"
# Utilities designed to make common development tasks easier
cask "devtoys"
# All-in-one toolbox for developers
cask "devutils"
# Voice and text chat software
cask "discord"
# Web browser focusing on privacy
cask "duckduckgo"
# Calendar software
cask "fantastical"
cask "font-droid-sans-mono-for-powerline"
cask "font-droid-sans-mono-nerd-font"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-fira-mono"
cask "font-hack-nerd-font"
cask "font-space-mono"
cask "font-symbols-only-nerd-font"
# Web browser
cask "google-chrome"
# Git client focusing on productivity
cask "gitkraken"
# Web browser
cask "google-chrome"
# Desktop automation application
cask "hammerspoon"
# Open source API development ecosystem
cask "hoppscotch"
# System monitoring app
cask "istat-menus"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Terminal emulator Warp
cask "warp"
# ZSA keyboard firmware flasher
cask "keymapp"
# Discover, download, and run local LLMs
cask "lm-studio"
# Adaptive brightness for external displays
cask "lunar"
# Neovim Client
cask "neovide"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Get up and running with large language models locally
cask "ollama"
# Verify system files structure, run miscellaneous maintenance and more
cask "onyx"
# Replacement for Docker Desktop
cask "orbstack"
# Desktop virtualization software
cask "parallels"
# PDF reader, editor and annotator
cask "pdf-expert"
# Browse, manage, inspect containers and images
cask "podman-desktop"
# Collaboration platform for API development
cask "postman"
# HTTP debugging proxy
cask "proxyman"
# Companion app for Flipper Zero devices
cask "qflipper"
# Control your tools with a few keystrokes
cask "raycast"
# Instant messaging application focusing on security
cask "signal"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Daily planner and calendar
cask "sunsama"
# Email client
cask "superhuman"
# Network toolbox
cask "surge"
# Mesh VPN based on WireGuard
cask "tailscale"
# To-do list
cask "todoist"
# Open-source code editor
cask "visual-studio-code"
# Video communication and virtual meeting platform
cask "zoom"
mas "Bear", id: 1091189122
mas "Bitwarden", id: 1352778147
mas "Developer", id: 640199958
mas "Grammarly for Safari", id: 1462114288
mas "KakaoTalk", id: 869223134
mas "Kindle", id: 302584613
mas "LanScan", id: 472226235
mas "Omnivore", id: 1564031042
mas "TestFlight", id: 899247664
vscode "42crunch.vscode-openapi"
vscode "4ops.terraform"
vscode "aaron-bond.better-comments"
vscode "actboy168.lua-debug"
vscode "akamud.vscode-javascript-snippet-pack"
vscode "alefragnani.bookmarks"
vscode "alefragnani.project-manager"
vscode "alefragnani.rtf"
vscode "amazonemr.emr-tools"
vscode "amazonwebservices.amazon-q-vscode"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "antfu.browse-lite"
vscode "antfu.icons-carbon"
vscode "antfu.vite"
vscode "arcticicestudio.nord-visual-studio-code"
vscode "arrterian.nix-env-selector"
vscode "arturock.gitstash"
vscode "ashinzekene.nestjs"
vscode "asvetliakov.vscode-neovim"
vscode "atishay-jain.all-autocomplete"
vscode "atlassian.atlascode"
vscode "batisteo.vscode-django"
vscode "bbenoist.nix"
vscode "biomejs.biome"
vscode "blackboxapp.blackbox"
vscode "bodil.file-browser"
vscode "bradlc.vscode-tailwindcss"
vscode "buenon.scratchpads"
vscode "burkeholland.simple-react-snippets"
vscode "bysabi.prettier-vscode-standard"
vscode "catppuccin.catppuccin-vsc"
vscode "chaitanyashahare.lazygit"
vscode "charliermarsh.ruff"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "chrmarti.regex"
vscode "ckolkman.vscode-postgres"
vscode "clinyong.vscode-css-modules"
vscode "codeium.codeium"
vscode "codium.codium"
vscode "continue.continue"
vscode "cstrap.flask-snippets"
vscode "cstrap.python-snippets"
vscode "danielsanmedium.dscodegpt"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "deerawan.vscode-dash"
vscode "diemasmichiels.emulate"
vscode "divyanshuagrawal.competitive-programming-helper"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "dsznajder.es7-react-js-snippets"
vscode "dzhavat.bracket-pair-toggler"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "emmanuelbeziat.vscode-great-icons"
vscode "enkia.tokyo-night"
vscode "equimper.react-native-react-redux"
vscode "ericsia.pythonsnippets3"
vscode "eriklynd.json-tools"
vscode "evan-buss.font-switcher"
vscode "file-icons.file-icons"
vscode "fill-labs.dependi"
vscode "firsttris.vscode-jest-runner"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "foxundermoon.shell-format"
vscode "frhtylcn.pythonsnippets"
vscode "george-alisson.html-preview-vscode"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "graphql.vscode-graphql-syntax"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "honnamkuan.golang-snippets"
vscode "humao.rest-client"
vscode "ibm.output-colorizer"
vscode "idered.npm"
vscode "infeng.vscode-react-typescript"
vscode "inferrinizzard.prettier-sql-vscode"
vscode "infracost.infracost"
vscode "jacano.vscode-pnpm"
vscode "jasonnutter.search-node-modules"
vscode "jawandarajbir.react-vscode-extension-pack"
vscode "jebbs.plantuml"
vscode "jithurjacob.nbpreviewer"
vscode "jnoortheen.nix-ide"
vscode "kahole.magit"
vscode "kamikillerto.vscode-colorize"
vscode "kevinrose.vsc-python-indent"
vscode "kisstkondoros.vscode-codemetrics"
vscode "lastmile-ai.vscode-aiconfig"
vscode "launchdarklyofficial.launchdarkly"
vscode "leetcode.vscode-leetcode"
vscode "leodevbro.blockman"
vscode "magicstack.magicpython"
vscode "mathematic.vscode-latex"
vscode "mattflower.aider"
vscode "mechatroner.rainbow-csv"
vscode "mgesbert.python-path"
vscode "mgmcdermott.vscode-language-babel"
vscode "mikestead.dotenv"
vscode "mintlify.document"
vscode "mkhl.direnv"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-azurestorage"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-playwright.playwright"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.flake8"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.azure-account"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.azurecli"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.js-debug-nightly"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.vscode-speech"
vscode "ms-vscode.vscode-typescript-next"
vscode "msjsdiag.vscode-react-native"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-pg"
vscode "naumovs.color-highlight"
vscode "njpwerner.autodocstring"
vscode "nrwl.angular-console"
vscode "oderwat.indent-rainbow"
vscode "oouo-diogo-perdigao.docthis"
vscode "orta.vscode-jest"
vscode "oven.bun-vscode"
vscode "parallelsdesktop.parallels-desktop"
vscode "pflannery.vscode-versionlens"
vscode "phind.phind"
vscode "pinage404.nix-extension-pack"
vscode "pkief.material-icon-theme"
vscode "planbcoding.vscode-react-refactor"
vscode "pmneo.tsimporter"
vscode "postman.postman-for-vscode"
vscode "prisma.prisma"
vscode "pulkitgangwar.nextjs-snippets"
vscode "qassimfarid.ejs-language-support"
vscode "qcz.text-power-tools"
vscode "quicktype.quicktype"
vscode "rangav.vscode-thunder-client"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "redocly.openapi-vs-code"
vscode "richie5um2.vscode-sort-json"
vscode "ritwickdey.liveserver"
vscode "rubbersheep.gi"
vscode "rubymaniac.vscode-paste-and-indent"
vscode "rust-lang.rust-analyzer"
vscode "rvest.vs-code-prettier-eslint"
vscode "ryanluker.vscode-coverage-gutters"
vscode "ryu1kn.edit-with-shell"
vscode "ryu1kn.partial-diff"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "sidneys1.gitconfig"
vscode "sidthesloth.html5-boilerplate"
vscode "skellock.just"
vscode "skyran.js-jsx-snippets"
vscode "sleistner.vscode-fileutils"
vscode "slevesque.vscode-multiclip"
vscode "sourcegraph.cody-ai"
vscode "sourcery.sourcery"
vscode "standard.vscode-standard"
vscode "statelyai.stately-vscode"
vscode "stringham.move-ts"
vscode "styled-components.vscode-styled-components"
vscode "sumneko.lua"
vscode "supermaven.supermaven"
vscode "tabnine.tabnine-vscode"
vscode "tailscale.vscode-tailscale"
vscode "tamasfe.even-better-toml"
vscode "teabyii.ayu"
vscode "techer.open-in-browser"
vscode "tim-koehler.helm-intellisense"
vscode "tombonnike.vscode-status-bar-format-toggle"
vscode "tomoki1207.pdf"
vscode "tomrijndorp.find-it-faster"
vscode "tonka3000.raycast"
vscode "tyriar.sort-lines"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vivaxy.vscode-conventional-commits"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "vsls-contrib.gitdoc"
vscode "vspacecode.vspacecode"
vscode "vspacecode.whichkey"
vscode "wayou.vscode-todo-highlight"
vscode "whizkydee.material-palenight-theme"
vscode "wholroyd.jinja"
vscode "wix.vscode-import-cost"
vscode "xabikos.javascriptsnippets"
vscode "xabikos.reactsnippets"
vscode "yinfei.luahelper"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
vscode "zainchen.json"
vscode "zenstack.zenstack"
vscode "zhang-renyang.vscode-react"
vscode "zhuangtongfa.material-theme"
